Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: If you’re merging more than two branches, Git picks the _octopus_ strategy.
es: Si se están fusionando más de dos ramas, Git suele escoger la _estrategia_del_pulpo_ (_octopus_ strategy).

source: The two that are disabled by default but can be turned on are `indent-with-non-tab`, which looks for lines that begin with eight or more spaces instead of tabs, and `cr-at-eol`, which tells Git that carriage returns at the end of lines are OK.
es: Los dos inactivos por defecto son 'indent-with-non-tab' (indentado sin tabuladores), que vigila por si alguna línea empieza con ocho o mas espacios en lugar de con tabuladores; y 'cr-at-eol' (retorno de carro al final de línea), que vigila para que haya retornos de carro en todas las líneas.

source: In this case, you already know what file it is.
es: En este caso, ya sabes de antemano cual es.

source: You can think of the data that Git contains for these structures as being like Figure 9-2.
es: Puedes pensar en algo parecido a la Figura 9-2 para representar los datos guardados por Git para estas estructuras.

source: After the entire commit process is completed, the `post-commit` hook runs.
es: Despues de completar todo el proceso de confirmación de cambios, es cuando se lanza el punto de enganche 'post-commit'.

source: You should now have a copy of the Git directory data in your `my_project.git` directory.
es: Tras esto, tendrás una copia de los datos en tu carpeta 'my_project.git'.

source: Be warned: this technique is destructive to your commit history.
es: Una advertencia importante: estas técnicas son destructivas y alteran el historia de confirmaciones de cambio.

source: Git concatenates the header and the original content and then calculates the SHA-1 checksum of that new content.
es: Git concatena la cabecera y el contenido original, para calcular la suma de control SHA-1 conjunta.

source: To remove it, you can run `git stash drop` with the name of the stash to remove:
es: Para quitarlos de ahí, es necesario lanzar expresamente el comando `git stash drop` e indicar el número de guardado a borrar de la pila:

source: This is roughly the same script as the server-side part, but with two important differences.
es: Este es un script prácticamente igual al del lado servidor. Pero con dos importantes diferencias.

source: ### The Nuclear Option: filter-branch ###
es: ### La opción nuclear: filter-branch ###

source: Let’s say you create a new branch called testing.
es: Por ejemplo, si quieres crear una nueva rama denominada "testing".

source: Git is a content-addressable filesystem.
es: Git es un sistema de archivo orientado a contenidos.

source: Each time, Git will stop, let you amend the commit, and continue when you’re finished.
es: En cada una de ellas, Git se detendrá, permitiendo enmendar la confirmación de cambios y continuar tras la modificación.

source: At that point, anyone who can access the web server under which you put the repository can also clone your repository.
es: A partir de ese momento, cualquiera con acceso al servidor web podrá clonar tu repositorio.

source: Again, you can use any web server for this; but as an example, we’ll demonstrate some basic Apache configurations that should give you an idea of what you might need.
es: Veremos algunas configuraciones básicas de Apache, para que puedas hacerte una idea de lo que puedes necesitar. (Recordar que esto es solo un ejemplo, y que puedes utilizar cualquier otro servidor web.)

source: Now that you’ve created, merged, and deleted some branches, let’s look at some branch-management tools that will come in handy when you begin using branches all the time.
es: Ahora que ya has creado, fusionado y borrado algunas ramas, vamos a dar un vistazo a algunas herramientas de gestión muy útiles cuando comienzas a utilizar ramas profusamente.

source: If you’ve been tracking files in your project and you want to move them out into a submodule, you must be careful or Git will get angry at you.
es: Si se ha estado trabajando en archivos de un proyecto al que luego se desea convertir en un submódulo, hay que ser muy cuidadoso o Git se resentirá.

source: Gitosis is going to manage your keys for you, so you need to remove the current file, re-add the keys later, and let Gitosis control the `authorized_keys` file automatically.
es: Gitosis manejará tus claves por tí, por lo que tendrás que quitar el archivo actual, añadir de nuevo las claves más tarde, y dejar que Gitosis tome automáticamente el control del archivo 'authorized_keys'.

source: The index is a file that contains offsets into that packfile so you can quickly seek to a specific object.
es: El índice es un archivo que contiene las posiciones de cada uno de esos objetos dentro del archivo empaquetador. Permitiendonos así buscarlos y extraer rápidamente cualquiera de ellos.

source: You can also combine these syntaxes — you can get the second parent of the previous reference (assuming it was a merge commit) by using `HEAD~3^2`, and so on.
es: E incluso también es posible combinar las dos sintaxis. Por ejemplo, para referirse al "segundo padre de la referencia previa" (asumiendo que es una confirmación de cambios de fusión -merge-), se pude escribir algo como `HEAD~3^2`.

source: This is a powerful tool that can help you check hundreds of commits for an introduced bug in minutes.
es: Esta es una poderosa herramienta que permite chequear en minutos cientos de confirmaciones de cambio, para determinar rápidamente en que punto se pudo introducir el error.

source: You can remove the `client` and `server` branches because all the work is integrated and you don’t need them anymore, leaving your history for this entire process looking like Figure 3-35:
es: Y por último puedes eliminar las ramas 'client' y 'server' porque ya todo su contenido ha sido integrado y no las vas a necesitar más. Dejando tu registro tras todo este proceso tal y como se muestra en la Figura 3-35:

source: Insert 18333fig0506.png Figure 5-6.
es: Insert 18333fig0506.png Figura 5-6.

source: In that case, the `git am` process will fail and ask you what you want to do:
es: En ese caso, el proceso 'git am' fallará y te preguntará qué deseas hacer:

source: These are some commonly used workflows that are possible with a distributed system like Git, but you can see that many variations are possible to suit your particular real-world workflow.
es: Hemos visto algunos de los flujos de trabajo mas comunes permitidos por un sistema distribuido como Git. Pero seguro que habrás comenzado a vislumbrar multiples variaciones que puedan encajar con tu particular forma de trabajar.

source: Also, although the blob content can be nearly anything, the commit and tree content are very specifically formatted.
es: Además, el contenido de un binario (blob) puede ser prácticamente cualquier cosa. Mientras que el contenido de una confirmación de cambios (commit) o de un árbol (tree) han de seguir unos formatos internos muy concretos.

source: For a more in-depth tutorial on creating an SSH key on multiple operating systems, see the GitHub guide on SSH keys at `http://github.com/guides/providing-your-ssh-key`.
es: Para más detalles sobre cómo crear unas claves SSH en variados sistemas operativos, consultar la correspondiente guia en GitHub: `http://github.com/guides/providing-your-ssh-key`.

source: Git comes preset to detect and fix some whitespace issues.
es: Git viene preajustado para detectar y resolver algunos de los problemas más tipicos relacionados con los espacios en blanco.

source: Generally, you’ll type `y` or `n` if you want to stage each hunk, but staging all of them in certain files or skipping a hunk decision until later can be helpful too.
es: Habitualmente se tecleará 'y' o 'n' según se desee pasar o no cada trozo. Pero habrá ocasiones donde pueda ser útil pasar todos ellos conjuntamente, o el dejar para más tarde la decisión sobre un trozo concreto.

source: So, if there is a `master` branch on the server, you can access the log of that branch locally via
es: De tal forma que, si existe una rama `master` en el servidor, puedes acceder a ella localmente a través de

source: For example, if you make two changes to your simplegit.rb file and want to stage one of them and not the other, doing so is very easy in Git.
es: Por ejemplo, si se han realizado dos cambios en el archivo simplegit.rb y se desea pasar solo uno de ellos al área de preparación, pero no el otro.

source: Now `origin/master` is reachable from Jessica’s `master` branch, so she should be able to successfully push (assuming John hasn’t pushed again in the meantime):
es: En este punto, la rama 'origin/master' es alcanzable desde la rama 'master' de Jessica, permitiendole enviar (push) --asumiendo que John no haya enviado nada más durante ese tiempo--:

source: If they’re safe, they’re merged into `next`, and that branch is pushed up so everyone can try the topics integrated together.
es: Las funcionalidades que resultan ser seguras y estar preparadas se fusionan (merge) en la rama 'next'; y esta es enviada (push) al repositorio público, para que cualquiera pueda probarlas.

source: When other developers try to run `git submodule update`, the submodule system can’t find the commit that is referenced, because it exists only on the first developer’s system.
es: Cuando otros desarrolladores intenten lanzar un `git submodule update`, será imposible encontrar la confirmación de cambios a la que se refiere el submódulo, ya que esta tan solo existe en el sistema del desarrollador original.

source: The first script to run when handling a push from a client is `pre-receive`.
es: El primer script que se activa al manejar un envio de un cliente es el correspondiente al punto de enganche 'pre-receive'.

source: **Do not rebase commits that you have pushed to a public repository.**
es: **Nunca reorganices confirmaciones de cambio (commits) que hayas enviado (push) a un repositorio público.**

source: Rebasing your server branch on top of your master branch.
es: Reorganizando la rama 'server' sobre la rama 'branch'.

source: You’ll add some larger content to the repository to demonstrate an interesting feature of Git.
es: Puedes añadir algún otro archivo de gran contenido al repositorio. Y verás una interesante funcionalidad de Git.

source: Then, when the script drops you to the command line, you reset that commit, take the changes that have been reset, and create multiple commits out of them.
es: Después, cuando el script devuelva la línea de comandos, se ha de deshacer (reset) esa confirmación de cambios, coger los cambios recién deshechos y crear multiples nuevas confirmaciones de cambios con ellos.

source: You’ll have the `update` hook look at those rules, see what files are being introduced for all the commits being pushed, and determine whether the user doing the push has access to update all those files.
es: Y tienes que preparar el enganche 'update' para hacerle consultar esas reglas, mirar los archivos que están siendo subidos en las confirmaciones de cambio (commit) enviadas (push), y determinar así si el usuario emisor del envio tiene o no permiso para actualizar esos archivos.

source: Because the reflog data is kept in the `.git/logs/` directory, you effectively have no reflog.
es: La información de registro (reflog) se guarda en la carpeta `.git/logs/`; por lo que, borrandola, nos quedamos efectivamente sin registro.

source: The difference becomes apparent when you specify a number.
es: Pero la diferencia comienza al indicar un número tras ella.

source: However, any language will work fine.
es: Pero, puede ser igualmente válido cualquier otro lenguaje.

source: The public keys look something like this:
es: La clave pública será una serie de números, letras y signos, algo así como esto:

source: But suppose you didn’t; how would you identify what file or files were taking up so much space?
es: Pero suponiendo que no lo supieras, ¿cómo podrías identificar el archivo o archivos que están ocupando tanto espacio?.

source: Often, the quickest way is to use a tool called `git reflog`.
es: El método más rápido para conseguirlo suele ser utilizar una herramienta denominada `git reflog`.

source: This is a configuration file that stores the mapping between the project’s URL and the local subdirectory you’ve pulled it into:
es: un archivo de configuración para almacenar las relaciones entre la URL del proyecto y la subcarpeta local donde se ha colocado este.

source: With the `rebase` command, you can take all the changes that were committed on one branch and replay them on another one.
es: Con el comando 'git rebase', puedes coger todos los cambios confirmados en una rama, y reaplicarlos sobre otra.

source: ### Issues with Submodules ###
es: ### Posibles problemáticas al usar submódulos ###

source: The Graphs tab has some contribution visualizations and statistics about your project.
es: La pestaña "Graphs" muestra diversas visualizaciones sobre contribuciones y estadísticas de tu proyecto.

source: This is the basic information that the commit object stores for you.
es: Este es el tipo de información que almacenan para tí los objetos de confirmación de cambios.

source: Rebasing changes the SHA-1 hashes of these commits so to Git they look like new commits, when in fact you already have the C4 work in your history (see Figure 3-39).
es: La reorganización cambia los resumenes (hash) SHA-1 de esas confirmaciones (commits), haciendo que Git se crea que son nuevas confirmaciones. Cuando realmente tu ya tenias el trabajo de C4 en tu registro.

source: You can modify these limits with the `gc.auto` and `gc.autopacklimit` config settings, respectively.
es: Estos límites pueden configurarse con las opciones de configuración `gc.auto` y `gc.autopacklimit`, respectivamente.

source: If you add text between the `---` line and the beginning of the patch (the `lib/simplegit.rb` line), then developers can read it; but applying the patch excludes it.
es: Si añades texto entre la línea que comienza por `---` y el comienzo del parche (la línea `lib/simplegit.rb). Los desarrolladores de la lista de correo podrán leerlo. Pero será ignorado al aplicar el parche al proyecto.

source: Note that someone must shell onto the machine and create a bare repository every time you want to add a project.
es: Cabe indicar que alguien tendrá que iniciar sesión en la máquina y crear un repositorio básico, cada vez que se desee añadir un nuevo proyecto.

source: All the server-side work will go into the update file in your hooks directory.
es: Todo el trabajo del lado servidor va en el script 'update' de la carpeta 'hooks'.

source: Jessica’s initial commit history.
es: Historial inicial de Jessica.

source: This discussion will include not having to create user accounts for each user, adding public read access to repositories, setting up web UIs, using the Gitosis tool, and more.
es: Incluyendo temas tales como el evitar crear cuentas para cada usuario, el añadir acceso público de lectura, el disponer interfaces de usuario web, el usar la herramienta Gitosis, y mucho más.

source: There are a couple of reasons for this — the object could be in an alternate repository, or it could be in a packfile in this repository.
es: Puede haber un par de razones para que suceda esto: el objeto está en otro repositorio alternativo; o el objeto está en este repositorio, pero dentro de un objeto empaquetador (packfile).

source: Now, run the `cat-file` command on that SHA-1 value:
es: Ahora, lanzando el comando `cat-file` para ese valor SHA-1:

source: You can’t use partial globs in the pattern, so this would be invalid:
es: Pero, en ningún caso puedes poner referencias genéricas parciales; por ejemplo, algo como esto sería erroneo:

source: The second developer, Jessica, does the same thing — clones the repository and commits a change:
es: La segunda desarrolladora, Jessica, hace lo mismo: clona el repositorio y confirma algunos cambios:

source: This hook can likewise validate the presence of files external to Git control that you may want copied in when the working tree changes.
es: Este punto de enganche puede utilizarse también para comprobar la presencia de ciertos archivos, externos al control de Git, que desees copiar cada vez que cambie la carpeta de trabajo.

source: The `gc` stands for garbage collect, and the command does a number of things: it gathers up all the loose objects and places them in packfiles, it consolidates packfiles into one big packfile, and it removes objects that aren’t reachable from any commit and are a few months old.
es: `gc` corresponde a "recogida de basura" (garbage collect), y este comando realiza toda una serie de acciones: recoge los objetos sueltos y los agrupa en archivos empaquetadores; consolida los archivos empaquetadores pequeños en un solo gran archivo empaquetador; retira los objetos antiguos no incorporados a ninguna confirmación de cambios.

source: This way, when people clone your project’s repository, they can either check out master to build the latest stable version and keep up to date on that easily, or they can check out develop, which is the more cutting-edge stuff.
es: De esta forma, cuando alguien clone el repositorio de tu proyecto, podrá recuperar (checkout) y mantener actualizadas tanto la última version estable como la versión con el material más avanzado; en las ramas 'master' y 'develop', respectivamente.

source: You can distribute these hooks within the project or in a separate project, but there is no way to set them up automatically.
es: Puedes distribuir esos enganches dentro del mismo proyecto o en un proyecto separado. Pero no hay modo de implementarlos automáticamente.

source: The commit message by default looks something like this:
es: El mensaje de confirmación por defecto será algo parecido a:

source: When you rebase stuff, you’re abandoning existing commits and creating new ones that are similar but different.
es: Cuando reorganizas algo, estás abandonando las confirmaciones de cambio ya creadas y estás creando unas nuevas; que son similares, pero diferentes.

source: For each reference that this push will update, the `send-pack` process tells the `receive-pack` process that information.
es: Para cada una de las referencias que se van a actualizar, el proceso `send-pack` llama al proceso `receive-pack` con la información pertinente.

source: You do this with the `git merge` command:
es: Esto se hace con el comando 'git merge':

source: You can save a stash on one branch, switch to another branch later, and try to reapply the changes.
es: Es perfectamente posible guardar rápidamente (stash) el estado de una rama. Cambiar posteriormente a otra rama. Y proceder a aplicar sobre esta otra rama los cambios guardados, en lugar de sobre la rama original.

source: The `send-pack` process runs on the client and connects to a `receive-pack` process on the remote side.
es: El proceso `send-pack` corre en el cliente y conecta con el proceso `receive-pack` corriendo en el lado remoto.

source: You then fetch from that server, bringing down the new commits.
es: Tu te traes (fetch) esos nuevos cambios desde el servidor.

source: Many Git developers have a workflow that embraces this approach, such as having only code that is entirely stable in their `master` branch — possibly only code that has been or will be released.
es: Muchos desarrolladores que usan Git llevan un flujo de trabajo de esta naturaleza, manteniendo en la rama 'master' únicamente el código totalmente estable (el código que ha sido o que va a ser liberado).

source: The `master^{tree}` syntax specifies the tree object that is pointed to by the last commit on your `master` branch.
es: La sentencia `master^{tree}` indica el objeto árbol apuntado por la última confirmación de cambios (commit) en tu rama principal (master).

source: The line should look something like this:
es: Quedará una linea algo así como:

source: To get the appropriate SHA for a given reference, Git checks for that reference in the `refs` directory and then checks the `packed-refs` file as a fallback.
es: Para obtener la clave SHA correspondiente a una determinada referencia, Git comprobará primero en la carpeta `refs` y luego en el archivo `packed-refs`.

source: The first four hooks have to do with the committing process.
es: Los primeros cuatro puntos de enganche están relacionados con el proceso de confirmación de cambios.

source: This hook generally isn’t useful for normal commits; rather, it’s good for commits where the default message is auto-generated, such as templated commit messages, merge commits, squashed commits, and amended commits.
es: Este punto de enganche no tiene mucha utilidad para las confirmaciones de cambios normales; pero sí para las confirmaciones donde el mensaje por defecto es autogenerado, como en las confirmaciones de fusiones (merge), los mensajes con plantilla, las confirmaciones aplastadas (squash), o las confirmaciones de correccion (amend).

source: When you save and exit the editor, Git rewinds your branch to the parent of these commits, applies `310154e` and then `f7f3f6d`, and then stops.
es: Cuando se guarde y salga en el editor, Git rebobinará la rama hasta el padre de las confirmaciones de cambio indicadas, reaplicará `310154e` y luego `f7f3f6d`, para finalmente detenerse.

source: The `--tree-filter` option runs the specified command after each checkout of the project and then recommits the results.
es: Esta opción `--tree-filter`, tras cada extracción (checkout) del proyecto, lanzará el comando especificado y reconfirmará los cambios resultantes(recommit).

source: To see an up-to-date list, check out the GitHosting page on the main Git wiki:
es: Para obtener una lista actualizada, puedes mirar en la página GitHosting del wiki principal de Git:

source: Project header with a public URL and a private URL.
es: Cabecera de proyecto, con una URL pública y otra URL privada.

source: Here is an example, where I’ve replaced a red terminal color with `X`s:
es: Aquí van algunos ejemplos, en los que hemos sustituido las marcas rojas por 'X's:

source: Before a topic branch merge.
es: Antes de fusionar una rama puntual.

source: ### Summary ###
es: ### Recapitulación ###

source: It sends all the objects it already has with "have" and then the SHA.
es: Los objetos que ya tiene, los envia con "have" (tengo) y la correspondiente clave SHA.

source: You must pass it the `--add` option because the file doesn’t yet exist in your staging area (you don’t even have a staging area set up yet) and `--cacheinfo` because the file you’re adding isn’t in your directory but is in your database.
es: Has de utilizar la opción `--add`, porque el archivo no existe aún en tu área de preparación (es más, ni siquiera tienes un área de preparación). Y has de utilizar también la opción `--cacheinfo`, porque el archivo que estas añadiendo no está en tu carpeta, sino en tu base de datos.

source: Click the "edit" button in the project header or the Admin tab at the top of the project to reach the Admin page of your GitHub project (see Figure 4-10).
es: Has de hacer clic sobre el botón "edit" en la cabecera del proyecto o en la pestaña Admin de la parte superior del proyecto; yendo así a la página de administración del proyecto GitHub.

source: You need to push your work up to it.
es: Tu trabajo lo enviarás (push) a este segundo remoto.

source: I’ll go over all these plumbing commands in detail in Chapter 9; but for now, here’s what that command gives you:
es: En el capítulo 9 volveremos en detalle sobre estos comandos de mantenimiento; pero, por ahora, esto es lo que obtienes con dicho comando:

source: You can recover it the same way, by adding a branch that points to that SHA.
es: Y la puedes recuperar del mismo modo, añadiendo una rama que apunte a esa clave SHA.
